In [10]:
#Install psycopg2
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\crazy\anaconda3\lib\site-packages (2.8.6)

In [11]:
#necessary imports
from sqlalchemy import create_engine
from db_config import username, password
import pandas as pd

In [12]:
#Create engine to allow for connection to database & connect
#f string allows for the variables to be used for UN and PW

engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/Pewlett_Hackard_Employees')
connection = engine.connect()

In [25]:
#Get the employees table from db and convert to dataframe
emp_df = pd.read_sql("select * from employees", connection)
emp_df.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001   7/25/1953    Hideyuki   Zallocco   M   4/28/1990
1  475053        e0002  11/18/1954       Byong  Delgrande   F    9/7/1991
2   57444        e0002   1/30/1958       Berry       Babb   F   3/21/1992
3  421786        s0001   9/28/1957       Xiong   Verhoeff   M  11/26/1987
4  282238        e0003  10/28/1952  Abdelkader    Baumann   F   1/18/1991

In [15]:
#Get the title table from db and convert to df
title_df = pd.read_sql("select * from titles", connection)
title_df

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

In [16]:
#Get the salary table from db and convert to df
salary_df = pd.read_sql("select * from salaries", connection)
salary_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [19]:
#Merge the employees table with the salary table
emp_salary_merged_df = pd.merge(emp_df, salary_df , on=("emp_no"), how="inner")
emp_salary_merged_df.head()

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990,40000
1,475053,e0002,11/18/1954,Byong,Delgrande,F,9/7/1991,53422
2,57444,e0002,1/30/1958,Berry,Babb,F,3/21/1992,48973
3,421786,s0001,9/28/1957,Xiong,Verhoeff,M,11/26/1987,40000
4,282238,e0003,10/28/1952,Abdelkader,Baumann,F,1/18/1991,40000

In [24]:
#Add the correct employee title to the employee/salary df

#Empty list to hold the titles that correspond with each employee
titles = []

#Loop through employee/salary df to determine employee title, store correct one in the titles list
title_id = emp_salary_merged_df["emp_title_id"]
for id in title_id:
    if id == 's0001':
        titles.append("Staff")
    if id == 's0002':
        titles.append("Senior Staff")
    if id == 'e0001':
        titles.append("Assistant Engineer")
    if id == 'e0002':
        titles.append("Engineer")
    if id == 'e0003':
        titles.append("Senior Engineer")
    if id == 'e0004':
        titles.append("Technique Leader")
    if id == 'm0001':
        titles.append("Manager")
        
#Make a copy of the original dataframe so it isn't modified
emp_salary_title_df = emp_salary_merged_df.copy()

#Add the title column to the new dataframe
emp_salary_title_df.insert(8, "Title", titles)
emp_salary_title_df.head()

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary,Title
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990,40000,Staff
1,475053,e0002,11/18/1954,Byong,Delgrande,F,9/7/1991,53422,Engineer
2,57444,e0002,1/30/1958,Berry,Babb,F,3/21/1992,48973,Engineer
3,421786,s0001,9/28/1957,Xiong,Verhoeff,M,11/26/1987,40000,Staff
4,282238,e0003,10/28/1952,Abdelkader,Baumann,F,1/18/1991,40000,Senior Engineer

In [23]:
#Make a copy of the original dataframe so it isn't modified
emp_salary_title_df = emp_salary_merged_df.copy()

#Add the percentage column to the new dataframe
emp_salary_title_df.insert(8, "Title", titles)
emp_salary_title_df.head()

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary,Title
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990,40000,Staff
1,475053,e0002,11/18/1954,Byong,Delgrande,F,9/7/1991,53422,Engineer
2,57444,e0002,1/30/1958,Berry,Babb,F,3/21/1992,48973,Engineer
3,421786,s0001,9/28/1957,Xiong,Verhoeff,M,11/26/1987,40000,Staff
4,282238,e0003,10/28/1952,Abdelkader,Baumann,F,1/18/1991,40000,Senior Engineer